kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_panel_adc(panel_status_t *panel_status, common_panel_t *common_panel, adc_value_t *adc_value, bool is_ex)
{
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        if (adc_value->vol >= panel_status[i].vol_range.min && adc_value->vol <= panel_status[i].vol_range.max) {
            // 填充满buffer才会执行下面的代码
            adc_value->vol_buf[adc_value->buf_idx++] = adc_value->vol;
            if (adc_value->buf_idx >= ADC_VALUE_COUNT) {
                adc_value->buf_idx  = 0;
                adc_value->buf_full = 1;
                uint16_t new_value  = app_calculate_average(adc_value->vol_buf, ADC_VALUE_COUNT);
                if (new_value >= panel_status[i].vol_range.min && new_value <= panel_status[i].vol_range.max) {
                    if (panel_status[i].key_press == false) {
                        if (common_panel->enter_config == false) {
                            panel_status[i].key_status = !panel_status[i].key_status;
                            if (panel_status[i].relay_short != false) { // 有继电器正在短开,发送特殊命令
                                app_send_cmd(i, 0x00, PANEL_HEAD, SPECIAL_CMD, is_ex);
                            } else {
                                app_send_cmd(i, panel_status[i].key_status, PANEL_HEAD, COMMON_CMD, is_ex);
                            }
                            panel_status[i].key_press = true;
                        }
                        common_panel->key_long_press = true;
                        common_panel->key_long_count = 0;
                    } else if (common_panel->key_long_press == true) {
                        common_panel->key_long_count++;
                        if (common_panel->key_long_count >= LONG_PRESS) {
                            app_send_cmd(0, 0, APPLY_CONFIG, 0x00, is_ex);
                            common_panel->key_long_press = false;
                        }
                    }
                }
            }
        } else if (adc_value->vol >= DEFAULT_MIN_VALUE && adc_value->vol <= DEFAULT_MAX_VALUE) {
            panel_status[i].key_press    = false;
            common_panel->key_long_press = false;
            common_panel->key_long_count = 0;
        }
    }
}

static void process_led_flicker(common_panel_t *common_panel, bool is_ex_panel)
{
    common_panel->led_filck_count++;
    if (common_panel->led_filck_count <= 500) {
        panel_ctrl_led_all(false, is_ex_panel);
    } else if (common_panel->led_filck_count <= 1000) {
        panel_ctrl_led_all(true, is_ex_panel);
    } else if (common_panel->led_filck_count <= 1500) {
        panel_ctrl_led_all(false, is_ex_panel);
    } else {
        common_panel->led_filck_count = 0;
        common_panel->led_filck       = false;
        panel_ctrl_led_all(true, is_ex_panel);
    }
}

static void panel_proce_cmd(TimerHandle_t xTimer)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_exe_status(temp_cfg, my_panel_status);
    #if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_exe_status(temp_cfg_ex, my_panel_status_ex);
    #endif
}

static void process_exe_status(const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        panel_status_t *p_status = &temp_status[i];
        const panel_cfg_t *p_cfg = &temp_cfg[i];

        if (p_status->led_w_short) { // 白灯短亮逻辑
            if (p_status->led_w_short_count++ == 0) {
                p_status->led_w_open = true;
            }
            if (p_status->led_w_short_count >= SHORT_TIME_LED) {
                p_status->led_w_open        = false;
                p_status->led_w_short       = false;
                p_status->led_w_short_count = 0;
            }
        }
        if (p_status->relay_short) { // 继电器短开逻辑
            if (p_status->relay_open_count++ == 0) {
                p_status->relay_open = true;
            }
            if (p_status->relay_open_count >= SHORT_TIME_RELAY) {
                p_status->relay_open       = false;
                p_status->relay_short      = false;
                p_status->led_w_open       = false;
                p_status->key_status       = false;
                p_status->relay_open_count = 0;
            }
        }
        if (p_status->led_w_open != p_status->led_w_last) { // 白灯状态更新
            APP_SET_GPIO(p_cfg->led_w_pin, p_status->led_w_open);
            p_status->led_w_last = p_status->led_w_open;
            app_set_pwm_fade(p_cfg->led_y_pin, p_status->led_w_open ? 0 : 500, FADE_TIME);
        }

        if (p_status->relay_open != p_status->relay_last) { // 继电器状态更新
            APP_SET_GPIO(p_cfg->relay_pin[0], p_status->relay_open);
            APP_SET_GPIO(p_cfg->relay_pin[1], p_status->relay_open);
            APP_SET_GPIO(p_cfg->relay_pin[2], p_status->relay_open);
            APP_SET_GPIO(p_cfg->relay_pin[3], p_status->relay_open);
            p_status->relay_last       = p_status->relay_open;
            p_status->relay_open_count = 0;
        }
    }
}

static void panel_data_cb(valid_data_t *data)
{
    APP_PRINTF_BUF("[RECV]", data->data, data->length);
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_cmd_check(data, temp_cfg, my_panel_status);

    #if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_cmd_check(data, temp_cfg_ex, my_panel_status_ex);
    #endif
}

static void process_cmd_check(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    uint8_t cmd   = data->data[1];
    uint8_t sw    = data->data[2];
    uint8_t group = data->data[3];
    uint8_t area  = data->data[4];
    switch (cmd) {
        case ALL_CLOSE: { // 总关
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if ((BIT5(p_cfg->perm) == true) && // "睡眠"被勾选,"总开关分区"相同 或 0xF
                    ((H_BIT(area) == H_BIT(p_cfg->area)) || (H_BIT(area) == 0xF))) {
                    if (BIT5(p_cfg->perm) == true) { // 如果勾选了总关背光
                    }
                    switch (p_cfg->func) {
                        case ALL_CLOSE:
                            if (group == p_cfg->group) {
                                panel_fast_exe(p_status, (0b00011010 & ~0x01) | (sw & 0x01));
                            }
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x01);
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case ALL_ON_OFF:
                        case CLEAN_ROOM:
                            panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x00);
                            break;
                        case CURTAIN_CLOSE:
                            panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x00);
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;
        case ALL_ON_OFF: { // 总开关
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if ((BIT5(p_cfg->perm) == true) && // "总开关"被勾选,"总开关分区"相同 或 0xF
                    ((H_BIT(area) == H_BIT(p_cfg->area)) || (H_BIT(area) == 0xF))) {
                    switch (p_cfg->func) {
                        case ALL_ON_OFF:
                            if (group == p_cfg->group) {
                                panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                            }
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (~sw & 0x01));
                            break;
                        case SCENE_MODE: // 场景模式无法通过"总开关"打开
                            panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x00);
                            break;
                        case LIGHT_MODE:
                        case CLEAN_ROOM:
                            panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                            break;
                        case ALL_CLOSE:
                            panel_fast_exe(p_status, (0b00011010 & ~0x01) | (sw & 0x01));
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;
        case CLEAN_ROOM: { // 清理房间
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == CLEAN_ROOM &&
                    (group == p_cfg->group || group == 0xFF)) {
                    if (sw == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER; j++) {
                            const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                            panel_status_t *p_status_j = &temp_status[j];
                            if (p_cfg_j->func == DND_MODE &&
                                (group == p_cfg_j->group || group == 0xFF)) {
                                panel_fast_exe(p_status_j, (0b00010110 & ~0x01) | (~sw & 0x01));
                            }
                        }
                    }
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case DND_MODE: { // 勿扰模式
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == DND_MODE &&
                    (group == p_cfg->group || group == 0xFF)) {
                    if (sw == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER; j++) {
                            const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                            panel_status_t *p_status_j = &temp_status[j];
                            if (p_cfg_j->func == CLEAN_ROOM &&
                                (group == p_cfg_j->group || group == 0xFF)) {
                                panel_fast_exe(p_status_j, (0b00010110 & ~0x01) | (~sw & 0x01));
                            }
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case LATER_MODE: { // 请稍后
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == LATER_MODE &&
                    (group == p_cfg->group || group == 0xFF)) {
                    panel_fast_exe(p_status, (0b00100110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case CHECK_OUT: { // 退房
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == CHECK_OUT &&
                    (group == p_cfg->group || group == 0xFF)) {
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case SOS_MODE: { // 紧急呼叫
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == SOS_MODE &&
                    (group == p_cfg->group || group == 0xFF)) {
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case SERVICE: { // 请求服务
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == SERVICE &&
                    (group == p_cfg->group || group == 0xFF)) {
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case CURTAIN_OPEN: { // 窗帘开
            panel_curtain_open(data, temp_cfg, temp_status);
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == CURTAIN_OPEN &&
                    (group == p_cfg->group || group == 0xFF)) {
                    for (uint8_t j = 0; j < KEY_NUMBER; j++) { // 先关闭同分组的"窗帘关"
                        const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                        panel_status_t *p_status_j = &temp_status[j];
                        if (p_cfg_j->func == CURTAIN_CLOSE &&
                            (group == p_cfg_j->group || group == 0xFF)) {
                            panel_fast_exe(p_status_j, (0b00110000 & ~0x01) | 0x00);
                        }
                    }
                    panel_fast_exe(p_status, (0b00101010 & ~0x01) | 0x01);
                }
            }
        } break;
        case CURTAIN_CLOSE: { // 窗帘关
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == CURTAIN_CLOSE &&
                    (group == p_cfg->group || group == 0xFF)) {
                    for (uint8_t j = 0; j < KEY_NUMBER; j++) { // 先关闭同分组的"窗帘开"
                        const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                        panel_status_t *p_status_j = &temp_status[j];
                        if (p_cfg_j->func == CURTAIN_OPEN &&
                            (group == p_cfg_j->group || group == 0xFF)) {
                            panel_fast_exe(p_status_j, (0b00110000 & ~0x01) | 0x00);
                        }
                    }
                    panel_fast_exe(p_status, (0b00101010 & ~0x01) | 0x01);
                }
            }
        } break;
        case SCENE_MODE: { // 场景模式
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if ((p_cfg->scene_group != 0x00) && // 屏蔽掉没有勾选任何场景分组的按键
                    ((L_BIT(area) == L_BIT(p_cfg->area)) || (L_BIT(area) == 0xF))) {
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x00); // 先关闭该场景区域的所有分组
                    uint8_t mask = data->data[7] & p_cfg->scene_group;     // 找出两个字节中同为1的位
                    if (mask != 0) {                                       // 任意一位同为1,说明勾选了该场景分组,执行动作
                        panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                    }
                }
            }
        } break;
        case LIGHT_MODE: { // 灯控模式
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == LIGHT_MODE &&
                    (group == p_cfg->group || group == 0xFF)) {
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }

