kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
        } break;
        case NIGHT_LIGHT: { // 夜灯
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (p_cfg->func == NIGHT_LIGHT &&
                    (group == p_cfg->group || group == 0xFF)) {
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | (sw & 0x01));
                }
            }
        } break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: { // 窗帘停
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                const panel_cfg_t *p_cfg = &temp_cfg[i];
                panel_status_t *p_status = &temp_status[i];
                if (((p_cfg->func == CURTAIN_OPEN) || (p_cfg->func == CURTAIN_CLOSE)) &&
                    (group == p_cfg->group || group == 0xFF) &&
                    temp_status[i].relay_short == true) {
                    panel_fast_exe(p_status, (0b00111010 & ~0x01) | 0x00);
                }
            }
        } break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

static void panel_ctrl_led_all(bool led_state, bool is_ex)
{
    panel_status_t *temp = NULL;
    #ifndef PANEL_8KEY
    temp = my_panel_status;
    #endif
    #if defined PANEL_8KEY
    temp = is_ex ? my_panel_status_ex : my_panel_status;
    #endif
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        temp[i].led_w_open = led_state;
    }
}

static void panel_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: {
            panel_ctrl_led_all(true, false);
            my_common_panel.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: {
            panel_ctrl_led_all(false, false);
            my_common_panel.enter_config = false;
            NVIC_SystemReset(); // 退出"配置模式"后触发软件复位
        } break;
        case EVENT_SAVE_SUCCESS: {
            my_common_panel.led_filck = true;
        } break;
    #if defined PANEL_8KEY
        case EVENT_ENTER_CONFIG_EX:
            panel_ctrl_led_all(true, true);
            my_common_panel_ex.enter_config = true;
            break;
        case EVENT_EXIT_CONFIG_EX: {
            panel_ctrl_led_all(false, true);
            my_common_panel_ex.enter_config = false;
            NVIC_SystemReset();
        } break;
        case EVENT_SAVE_SUCCESS_EX: {
            my_common_panel_ex.led_filck = true;
        } break;
    #endif
        case EVENT_RECEIVE_CMD: {
            valid_data_t *valid_data = (valid_data_t *)params;
            panel_data_cb(valid_data);
        } break;
        default:
            return;
    }
}

// 执行上电参数(迎宾)
static void panel_power_status(void)
{
    process_exe_power(app_get_panel_cfg(), my_panel_status);
    #if defined PANEL_8KEY
    process_exe_power(app_get_panel_cfg_ex(), my_panel_status_ex);
    #endif
}

static void process_exe_power(const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        const panel_cfg_t *p_cfg = &temp_cfg[i];
        panel_status_t *p_status = &temp_status[i];
        if (BIT3(p_cfg->perm) == true) { // 权限是否勾选"迎宾"
            switch (p_cfg->func) {
                case LIGHT_MODE:
                    panel_fast_exe(p_status, (0b00010110 & ~0x01) | 0x01);
                    break;
                case SCENE_MODE: // 场景模式,不开白灯
                    panel_fast_exe(p_status, (0b00010000 & ~0x01) | 0x01);
                    break;
                default:
                    break;
            }
        }
    }
}

static void panel_fast_exe(panel_status_t *temp_fast, uint8_t flag)
{
    // 0位:data->data[2];1位:key_status;2位:led_w_open,3位:led_w_short,4位:relay_open;5位:relay_short;6位:保留;7位:保留

    if (BIT1(flag) == true) {
        temp_fast->key_status = BIT0(flag);
    }
    if (BIT2(flag) == true) {
        temp_fast->led_w_open = BIT0(flag);
    }
    if (BIT3(flag) == true) {
        temp_fast->led_w_short = true; // 短亮会快速熄灭,无需持续状态,故而不受data->data[2]控制
    }
    if (BIT4(flag) == true) {
        temp_fast->relay_open = BIT0(flag);
    }
    if (BIT5(flag) == true) {
        temp_fast->relay_short = BIT0(flag);
    }
}

// 窗帘开
static void panel_curtain_open(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CURTAIN_OPEN &&
            (data->data[4] == p_cfg->group || data->data[4] == 0xFF)) {
            PROCESS_INNER(temp_cfg, temp_status, {
                if (p_cfg_ex->func == CURTAIN_CLOSE &&
                    (data->data[4] == p_cfg_ex->group || data->data[4] == 0xFF)) {
                    panel_fast_exe(p_status_ex, (0b00110000 & ~0x01) | 0x00);
                }
            });
            panel_fast_exe(p_status, (0b00101010 & ~0x01) | 0x01);
        }
    });
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        const panel_cfg_t *p_cfg = &temp_cfg[i];
        panel_status_t *p_status = &temp_status[i];
        if (p_cfg->func == CURTAIN_OPEN &&
            (group == p_cfg->group || group == 0xFF)) {
            for (uint8_t j = 0; j < KEY_NUMBER; j++) { // 先关闭同分组的"窗帘关"
                const panel_cfg_t *p_cfg_j = &temp_cfg[j];
                panel_status_t *p_status_j = &temp_status[j];
                if (p_cfg_j->func == CURTAIN_CLOSE &&
                    (group == p_cfg_j->group || group == 0xFF)) {
                    panel_fast_exe(p_status_j, (0b00110000 & ~0x01) | 0x00);
                }
            }
            panel_fast_exe(p_status, (0b00101010 & ~0x01) | 0x01);
        }
    }
}
#endif